Autodesk.Revit.DB.BuiltInFailures.GridChainSketchFailures.OverlappingLines
GridChain sketch contains lines which overlap.

Autodesk.Revit.DB.BuiltInFailures.GridChainSketchFailures.MoreThanOneLoop
GridChain sketch contains more than one loop.

Autodesk.Revit.DB.BuiltInFailures.GridChainSketchFailures.InvalidSketch
Sketch is invalid. Grid sketch must consist of a single open loop with no intersecting lines.

Autodesk.Revit.DB.BuiltInFailures.GridChainSketchFailures.ClosedLoop
GridChain sketch contains a closed loop.

Autodesk.Revit.DB.BuiltInFailures.GridChainSketchFailures
Failures related to the GridChain sketch.